Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ2048EFH124.PIC
      <edc:SFRDef edc:_addr="0x1F860790" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="CNSTATH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="CNSTATH" edc:nzwidth="0x20" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATH0" edc:desc="" edc:mask="0x1" edc:name="CNSTATH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH1" edc:desc="" edc:mask="0x1" edc:name="CNSTATH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH4" edc:desc="" edc:mask="0x1" edc:name="CNSTATH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH5" edc:desc="" edc:mask="0x1" edc:name="CNSTATH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH6" edc:desc="" edc:mask="0x1" edc:name="CNSTATH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH8" edc:desc="" edc:mask="0x1" edc:name="CNSTATH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH9" edc:desc="" edc:mask="0x1" edc:name="CNSTATH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH10" edc:desc="" edc:mask="0x1" edc:name="CNSTATH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH12" edc:desc="" edc:mask="0x1" edc:name="CNSTATH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATH13" edc:desc="" edc:mask="0x1" edc:name="CNSTATH13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8607A0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="CNNEH" edc:desc="" edc:impl="0x3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="CNNEH" edc:nzwidth="32" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEH0" edc:mask="0x1" edc:name="CNNEH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH1" edc:mask="0x1" edc:name="CNNEH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEH4" edc:mask="0x1" edc:name="CNNEH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH5" edc:mask="0x1" edc:name="CNNEH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH6" edc:mask="0x1" edc:name="CNNEH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEH8" edc:mask="0x1" edc:name="CNNEH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH9" edc:mask="0x1" edc:name="CNNEH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH10" edc:mask="0x1" edc:name="CNNEH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEH12" edc:mask="0x1" edc:name="CNNEH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEH13" edc:mask="0x1" edc:name="CNNEH13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8607B0" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="------------------nn-nnn-nnn--nn" edc:cname="CNFH" edc:desc="" edc:impl="0x3773" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00-000-000--00" edc:name="CNFH" edc:nzwidth="32" edc:por="------------------00-000-000--00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFH0" edc:mask="0x1" edc:name="CNFH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH1" edc:mask="0x1" edc:name="CNFH1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFH4" edc:mask="0x1" edc:name="CNFH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH5" edc:mask="0x1" edc:name="CNFH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH6" edc:mask="0x1" edc:name="CNFH6" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFH8" edc:mask="0x1" edc:name="CNFH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH9" edc:mask="0x1" edc:name="CNFH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH10" edc:mask="0x1" edc:name="CNFH10" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFH12" edc:mask="0x1" edc:name="CNFH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFH13" edc:mask="0x1" edc:name="CNFH13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8607C0" edc:offset="0x40"/>
      <edc:SFRDef edc:_addr="0x1F860800" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn--------" edc:cname="ANSELJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------1-11--------" edc:name="ANSELJ" edc:nzwidth="0x20" edc:por="--------------------1-11--------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSJ8" edc:desc="" edc:mask="0x1" edc:name="ANSJ8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSJ9" edc:desc="" edc:mask="0x1" edc:name="ANSJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSJ11" edc:desc="" edc:mask="0x1" edc:name="ANSJ11" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860810" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="TRISJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------1-11---1-111" edc:name="TRISJ" edc:nzwidth="0x20" edc:por="--------------------1-11---1-111" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISJ0" edc:desc="" edc:mask="0x1" edc:name="TRISJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ1" edc:desc="" edc:mask="0x1" edc:name="TRISJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISJ2" edc:desc="" edc:mask="0x1" edc:name="TRISJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ4" edc:desc="" edc:mask="0x1" edc:name="TRISJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ8" edc:desc="" edc:mask="0x1" edc:name="TRISJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ9" edc:desc="" edc:mask="0x1" edc:name="TRISJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISJ11" edc:desc="" edc:mask="0x1" edc:name="TRISJ11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860820" edc:_begin="0x0" edc:_end="0xc0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="9" edc:access="--------------------n-nn---n-nnn" edc:cname="PORTJ" edc:desc="" edc:grp="PORTJ" edc:impl="0xffff0b17" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------x-xx---x-xxx" edc:name="PORTJ" edc:nzwidth="0x20" edc:por="--------------------x-xx---x-xxx" edc:portals="CLR SET INV" ltx:baseofperipheral="PORTJ">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RJ0" edc:desc="" edc:mask="0x1" edc:name="RJ0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ1" edc:desc="" edc:mask="0x1" edc:name="RJ1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RJ2" edc:desc="" edc:mask="0x1" edc:name="RJ2" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RJ4" edc:desc="" edc:mask="0x1" edc:name="RJ4" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RJ8" edc:desc="" edc:mask="0x1" edc:name="RJ8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="RJ9" edc:desc="" edc:mask="0x1" edc:name="RJ9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="RJ11" edc:desc="" edc:mask="0x1" edc:name="RJ11" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
